let select = prompt(`Виберіть операцію:
Натисніть 1, щоб зняти кошти;
Натисніть 2, щоб покласти кошти;
Натисніть 3, щоб перевірити баланс рахунку.`);
let balance = 10;
let sum = '';

if (select == '1') {
    let sum = prompt ('Введіть суму'); 
    if (sum <= balance) { 
        alert ('Oперація успішна, з Вашої картки знято' + ' ' + sum + ' ' + 'грн.');   
    } else {
        alert ('На Вашому рахунку бракує коштів.');
    }   
}
if (select == '2') {
    let sum = prompt ('Яку суму Ви хочете покласти');
    if (sum >= 1) {
        alert ('Суму' + ' ' + sum + ' ' + 'грн.' + ' ' + 'успішно зараховано.');
    } else {
        alert ('Невірний формат, спробуйте знову...');
    }
} 
if (select == '3') {
    alert ('На Вашому рахунку' + ' ' + balance + ' ' + 'грн.');
} 
if (select < '1') {
    alert ('Невірний формат, спробуйте знову...');
} 
if (select > '3') {
    alert ('Невірний формат, спробуйте знову...');
} 







   



